driver-tests/bpelse/xsddatatypes/XSDDataTypesBpel/src/MsgTypeToXSDType/xsddatatype14.wsdl

<definitions targetNamespace="http://stc.com/xsddatatype14" 
    name="xsddatatype14" 
    xmlns:tns="http://stc.com/xsddatatype14"    
    xmlns:ns1="urn:SampleXSD2"     
    xmlns:slnk1="http://docs.oasis-open.org/wsbpel/2.0/plnktype" 
    xmlns:tns0="http://stc.com/xsddatatype14" 
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
    xmlns="http://schemas.xmlsoap.org/wsdl/" 
    xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" 
    xmlns:slnk="http://schemas.xmlsoap.org/ws/2002/07/service-link/">

     <import location="SampleXSD2.xsd" namespace="urn:SampleXSD2"/>     
    <message name="xsddatatype14">
        <part name="part" element="ns1:elemUSAddressType"/>
    </message>
    <portType name="xsddatatype14">
        <operation name="xsddatatype14">
            <input message="tns:xsddatatype14"/>
            <output message="tns:xsddatatype14"/>
        </operation>
    </portType>
    <binding name="Binding" type="tns:xsddatatype14">
        <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="xsddatatype14">
            <soap:operation soapAction="xsddatatype14"/>
            <input>
                <soap:body use="literal"/>
            </input>
            <output>
                <soap:body use="literal"/>
            </output>
        </operation>
    </binding>
    <service name="xsddatatype14Service">
        <port name="port" binding="tns:Binding">
            <soap:address location="http://localhost:${HttpDefaultPort}/xsddatatype14"/>
        </port>
    </service>
    <plnk:partnerLinkType name="SLT" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype">
        <plnk:role name="server" portType="tns:xsddatatype14"/>
    </plnk:partnerLinkType>
</definitions>
