driver-tests/bpelse/xsddatatypes/XSDDataTypesJbi/test/MsgTypeToXSDType14/Input.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:SampleXSD2">
  <soapenv:Body>
    <urn:elemUSAddressType country="US">
     <urn:name>Richard Simmons</urn:name>
      <urn:street>800 Royal Oaks</urn:street>
      <urn:city>Monrovia</urn:city>
      <urn:state>CA</urn:state>
      <urn:zip>91016</urn:zip>
    </urn:elemUSAddressType>
  </soapenv:Body>
</soapenv:Envelope>