driver-tests/bpelse/xsddatatypes/XSDDataTypesJbi/test/results/MsgTypeToXSDType14/Actual_20130311131749_S.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
    xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <elemUSAddressType xmlns="urn:SampleXSD2" xmlns:msgns="http://stc.com/xsddatatype14">
      <name>Richard Simmons</name>
      <street>800 Royal Oaks</street>
      <city>Monrovia</city>
      <state>CA</state>
      <zip>91016</zip>
    </elemUSAddressType>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>